// Translation of Newspaper to various languages
const translateNewspaper = {
  "en": "newspapers",
  "hi": "समाचार पत्र",
  "ta": "செய்தித்தாள்கள்",
  "te": "వార్తా పత్రికలు",
  "ml": "പത്രങ്ങൾ",
  "bn": "খবরের কাগজ",
  "mr": "वृत्तपत्र",
  "kn": "ವಾರ್ತ ಪತ್ರಿಕೆಗಳು",
  "gu": "સમાચારપત્રો",
  "pa": " ਅਖਬਾਰਾਂ",
  "or": "ଖବର କାଗଜ",
  "ur": "اخبار",
  "bh": "समाचार पत्र",
  "ne": "समाचार पत्र"
}

const translateSuggested = {
  "hi": "सुझाए गए विषय",
  "ta": "பரிந்துரைக்கப்பட்ட தலைப்புகள்",
  "te": "సూచించిన విషయాలు",
  "ml": "നിർദ്ദേശിത വിഷയങ്ങൾ‍",
  "bn": "প্রস্তাবিত বিষয়",
  "mr": "ससूचित विषय",
  "kn": "ಸೂಚಿಸಿದ ವಿಷಯಗಳು",
  "gu": "સૂચવેલા વિષયો",
  "pa": "ਸੁਝਾਏ ਗਏ ਵਿਸ਼ੇ",
  "or": "ସୂଚିତ ବିଷୟ ",
  "ur": "تجویز کردہ موضوعات",
  "bh": "सुझाए गए विषय",
  "ne": "सुझाए गए विषय"
}

const translateRelated = {
  "hi": "संबंधित समाचार",
  "ta": "தொடர்புடைய கதைகள்",
  "te": "సంబంధిత కథలు",
  "ml": "ബന്ധപ്പെട്ട വാർത്തകൾ",
  "bn": "এ সম্পর্কিত আরো খবর",
  "mr": "संबंधित लेख",
  "kn": "ಸಂಬಂಧಿತ ಸುದ್ದಿ",
  "gu": "સંબંધિત લેખો",
  "pa": "ਸੰਬੰਧਿਤ ਕਹਾਣੀਆਂ ",
  "or": "ସମ୍ଵନ୍ଧିତ ସମାଚାର",
  "ur": "متعلقہ خبریں",
  "bh": "संबंधित समाचार",
  "ne": "संबंधित समाचार"
}

const translateChooseLang = {
  "hi": "अपनी भाषा चुनिए",
  "ta": "உங்கள் மொழியைத் தேர்வு செய்க",
  "te": "మీ భాషను ఎంచుకోండి",
  "ml": "നിങ്ങളുടെ താല്‍പര്യമുള്ള ഭാഷ തിരഞ്ഞെടുക്കുക",
  "bn": "ভাষা নির্বাচন করুন ",
  "mr": "आपली भाषा निवडा",
  "kn": "ನಿಮ್ಮ ಭಾಷೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡಿ",
  "gu": "તમારી ભાષા પસંદ કરો",
  "pa": "ਆਪਣੀ ਭਾਸ਼ਾ ਚੁਣੋ",
  "or": "ଆପଣଙ୍କ ଭାଷା ବଦଳାନ୍ତୁ ",
  "ur": "اپنی زبان کا انتخاب کریں",
  "bh": "अपनी भाषा चुनिए",
  "ne": "अपनी भाषा चुनिए",
}

const translateLang = {
  "hi": "भाषा",
  "ta": "மொழி",
  "te": "భాష",
  "ml": "ഭാഷ",
  "bn": "ভাষা ",
  "mr": "भाषा",
  "kn": "ಭಾಷೆ",
  "gu": "ભાષા",
  "pa": "ਭਾਸ਼ਾ",
  "or": "ଭାଷା",
  "ur": "زبان",
  "bh": "भाषा",
  "ne": "भाषा"
}

const translateBuzz = {
  "hi": "बज़",
  "ta": "பஸ்",
  "te": "బజ్",
  "ml": "ബസ്സ് ",
  "bn": "বাজ",
  "mr": "बझ",
  "kn": "ಬಜ಼್",
  "gu": "બઝ",
  "pa": "ਬਜ਼",
  "or": "ବଜ଼",
  "ur": "بز",
  "bh": "बज़",
  "ne": "बज़"
}

const translateAbout = {
  "hi": "हमारे बारे में",
  "ta": "எங்களைப் பற்றி",
  "te": "మా గురించి",
  "ml": "ഞങ്ങളേക്കുറിച്ച്",
  "bn": "আমাদের কথা",
  "mr": "आमच्या विषयी",
  "kn": "ನಮ್ಮ ಕುರಿತು",
  "gu": "અમારા વિશે",
  "pa": "ਸਾਡੇ ਬਾਰੇ",
  "or": "ଆମ ବିଷୟରେ",
  "ur": "ہمارے بارے میں",
  "bh": "हमारे बारे में",
  "ne": "हमारे बारे में"
}

const translateDownload = {
  "hi": "ऐप डाउनलोड करें",
  "ta": "செயலியை பெற",
  "te": "యాప్ ని డౌన్లోడ్ చేసుకోండి",
  "ml": "ആപ്പ് ഡൗൺലോഡ് ചെയ്യുക",
  "bn": "এপ্লিকেশনটি ডাউনলোড করুন ",
  "mr": "अॅप डाउनलोड करा",
  "kn": "ಆಪ್ ಡೌನ್ಲೋಡ್ ಮಾಡಿ",
  "gu": "એપ્લિકેશન ડાઉનલોડ કરો",
  "pa": "ਸੈਟਿੰਗਾਂ",
  "or": "ଆପ ଡାଉନଲୋଡ଼ କରନ୍ତୁ ",
  "ur": "اپلی کیشن ڈاؤن لوڈ کریں",
  "bh": "ऐप डाउनलोड करें",
  "ne": "ऐप डाउनलोड करें"
}

const translateBrowse = {
  "hi": "श्रेणी अनुसार देखें",
  "ta": "தலைப்பு வாரியாக தேடல்",
  "te": "విభాగం వారిగా బ్రౌజ్ చేయండి.",
  "ml": "വിഭാഗപ്രകാരം തിരയുക",
  "bn": "ক্যাটাগরি হিসাবে বাছুন",
  "mr": "विषयसूचीनुसार बघा",
  "kn": "ವಿಭಾಗಗಳ ಪ್ರಕಾರ  ಹುಡುಕಿ",
  "gu": "કેટેગરી પસંદ કરો",
  "pa": "ਸ਼੍ਰੇਣੀ ਦੁਆਰਾ ਤਲਾਸ਼ੋ",
  "or": "ବିଭାଗ ଅନୁଶାରେ ବ୍ରାଉଜ୍ କରନ୍ତୁ",
  "ur": "زمرے کے لحاظ سے براؤز کریںें",
  "bh": "श्रेणी अनुसार देखें",
  "ne": "श्रेणी अनुसार देखें"
}

const translateChangeLang = {
  "hi": "भाषा बदलेंं",
  "ta": "மொழியை மாற்று",
  "te": "భాషను మార్చుకోండి ",
  "ml": "ഭാഷ മാറ്റുക",
  "bn": "ভাষা পরিবর্তন করুন ",
  "mr": "भाषा बदला",
  "kn": "ಭಾಷೆ ಬದಲಾಯಿಸಿ",
  "gu": "ભાષા બદલો",
  "pa": "ਭਾਸ਼ਾ ਬਦਲੇਂ",
  "or": "ଭାଷା ବଦଳାନ୍ତୁ",
  "ur": "زبان تبدیل کریں",
  "bh": "भाषा बदलेंं",
  "sd": "भाषा बदलेंं"
}

const translateFeaturedTopics = {
  "hi": "विशेष विषय",
  "ta": "சிறப்பு தலைப்புகள்",
  "te": "ఫీచర్ చెయ్యబడిన విషయాలు",
  "ml": "ഫീച്ചർ ചെയ്ത വിഷയങ്ങൾ",
  "bn": "বৈশিষ্ট্যযুক্ত বিষয়",
  "mr": "विशेष टॉपिक",
  "kn": "ವಿಶಿಷ್ಠ ವಿಷಯಗಳು",
  "gu": "ખાસ વિષયો",
  "pa": "ਵਿਸ਼ੇਸ਼ ਰੂਪ ਤੋਂ ਦਿਖਾਏ ਗਏ ਵਿਸ਼ੇ",
  "or": "ବିଶେଷ ବିଷୟ",
  "ur": "خصوصی موضوعات",
  "bh": "विशेष विषय",
  "ne": "विशेष विषय"
}

const translateAllTopics = {
  "hi": "सभी विषय ",
  "ta": "முழுமையான பட்டியல் ",
  "te": "పూర్తి జాబితా",
  "ml": "പൂർണ്ണ പട്ടിക",
  "bn": "পুরো তালিকা ",
  "mr": "संपूर्ण यादी",
  "kn": "ಸಂಪೂರ್ಣ ವಿವರ",
  "gu": "સંપૂર્ણ યાદી",
  "pa": "ਪੂਰੀ ਸੂਚੀ",
  "or": "ସମ୍ପୁର୍ଣ୍ଣ ତାଲିକା",
  "ur": "مکمل فہرست",
  "bh": "सभी विषय ",
  "ne": "सभी विषय "
}

const translateTopics = {
  "hi": "विषय",
  "ta": "தலைப்புகள்",
  "te": "విషయాలు",
  "ml": "വിഷയങ്ങള്‍",
  "bn": "বিষয়",
  "mr": "विषय",
  "kn": "ವಿಷಯಗಳು",
  "gu": "વિષયો",
  "pa": "ਵਿਸ਼ੇ",
  "or": "ବିଷୟସମୂହ",
  "ur": "موضوعات",
  "bh": "विषय",
  "ne": "विषय"
}

const translateBrowseFurther = {
  "hi": "और देखें",
  "ta": "மேலும் ",
  "te": "మరింత బ్రౌజ్ చెయ్యండి",
  "ml": "കൂടുതൽ ബ്രൗസ് ചെയ്യാന്‍",
  "bn": "পুনরায় ব্রাউস",
  "mr": "पुढे शोधा",
  "kn": "ಮುಂದೆ ಬ್ರೌಸ್ ಮಾಡಿ",
  "gu": "આગળ શોધો",
  "pa": "ਹੋਰ ਤਲਾਸ਼ੋ",
  "or": "ବ୍ରାଉଜ୍ କରିକି ଆଗକୁ ବଢନ୍ତୁ",
  "ur": "مزيد براؤز کریں",
  "bh": "और देखें",
  "ne": "और देखें"
}

const translateClickHere = {
  "hi": "यहाँ क्लिक करें",
  "ta": "இங்கே கிளிக் செய்க",
  "te": "ఇక్కడ క్లిక్ చేయండి",
  "ml": "ഇവിടെ ക്ലിക്ക് ചെയ്യൂ",
  "bn": "ক্লিক করুন",
  "mr": "येथे क्लिक करा",
  "kn": "ಇಲ್ಲಿ ಕ್ಲಿಕ್ ಮಾಡಿ",
  "gu": "અહીં ક્લિક કરો",
  "pa": "ਇਥੇ ਕ੍ਲਿਕ ਕਰੋ",
  "or": "ଏଠି କ୍ଲିକ କରନ୍ତୁ",
  "ur": "یہاں کلک کری",
  "bh": "यहाँ क्लिक करे",
  "ne": "यहाँ क्लिक करें"
}

const translateEbooks = {
  "hi": "ई-बुक्स",
  "ta": "இ-புக்ஸ்",
  "te": "ఈ-బుక్స్",
  "ml": "ഇ-ബുക്ക്സ്",
  "bn": "ই-বুক",
  "mr": "ई-बुक्स",
  "kn": "ಈ-ಬುಕ್ಸ್",
  "gu": "ઈ-બુક્સ",
  "pa": "ਈ-ਬੁੱਕਸ",
  "or": "ଇ-ବୁକସ",
  "ur": "ای بکس",
  "bh": "ई-बुक्स",
  "ne": "ई-बुक्स"
}
const translateGetApp = {
  "hi": "ऐप पाओ",
  "ta": "செயலியை பெற",
  "te": "యాప్ పొందండి",
  "ml": "ആപ്പ് കിട്ടുവാന്‍",
  "bn": "অ্যাপ টি নিন",
  "mr": "एप मिळवा",
  "kn": "ಆಪ್ ಪಡೆಯಿರಿ",
  "gu": "એપ મેળવો",
  "pa": "ਐੱਪ ਪਾਓ",
  "or": "ଆପ୍ ପାଆନ୍ତୁ",
  "ur": "اپلی کیشن حاصل کریں",
  "bh": "ऐप पाओ",
  "ne": "ऐप पाओ"
}
const translateNotFound = {
  "hi": "ऐसा लग रहा है कि आप गलत पृष्ठ पर हैं",
  "ta": "நீங்கள் இழந்துவிட்டதாக தெரிகிறது",
  "te": "మీరు పోగొట్టుకున్నారు అనిపిస్తుంది",
  "ml": "നിങ്ങള്‍ക്ക് തെറ്റിയെന്ന്‍ തോന്നുന്നു‍",
  "bn": "মনে হচ্ছে আপনি বিভ্রান্ত",
  "mr": "असे दिसते की आपण हरवले आहेत",
  "kn": "ನೀವೆಲ್ಲೂ ಕಳೆದು ಹೋಗಿರುವ ಹಾಗಿದೆ",
  "gu": "એવું લાગે છે કે તમે ખોઈ રહ્યા છો",
  "pa": "ਐਂਵੇ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਗੁੰਮ ਹੋ ਰਹੇ ਹੋ",
  "or": "ଏମିତି ଲାଗୁଛି ଆପଣ ହଜିଯାଉଛନ୍ତି",
  "ur": "ایسا لگتا ہے کہ آپ غلط صفحہ پر ہیں",
  "bh": "ऐसा लग रहा है कि आप गलत पृष्ठ पर हैं",
  "ne": "ऐसा लग रहा है कि आप गलत पृष्ठ पर हैं"
}

const translateNotFoundAnother = {
  "hi": "आप जो पृष्ठ देख रहे हैं वह मौजूद नहीं है",
  "ta": "நீங்கள் தேடும் பக்கம் இனி இல்லை",
  "te": "మీరు చూస్తున్న పేజీ ఇక లేదు",
  "ml": "നിങ്ങൾ തിരയുന്ന പേജ് നിലവിലില്ല‍",
  "bn": "আপনি যে পেজটি খুঁজছেন সেটি আর নেই ",
  "mr": "आपण शोधत असलेले पृष्ठ अस्तित्वात नाही",
  "kn": "ನೀವು ಹುಡುಕುತ್ತಿರುವ ಪೇಜ್ ಸದ್ಯಕ್ಕೆ ಲಭ್ಯವಿಲ್ಲ ",
  "gu": "તમે શોધી રહ્યાં છો તે પેજ હવે અસ્તિત્વમાં નથી",
  "pa": "ਜੋ ਪੇਜ਼ ਤੁਸੀਂ ਵੇਖ ਰਹੇ ਹੋ ਓਹ ਹੁਣ ਮੌਜੂਦ ਨਹੀਂ ਹੈ",
  "or": "ଆପଣ ଯେଉଁ ପୃଷ୍ଟା ଦେଖୁଛନ୍ତି ତାହା ଏବେ ଉପଲବ୍ଧ ନାହିଁ ",
  "ur": "وہ صفحہ جو آپ تلاش کر رہے ہیں اب موجود نہیں ہے",
  "bh": "आप जो पृष्ठ देख रहे हैं वह मौजूद नहीं है",
  "ne": "आप जो पृष्ठ देख रहे हैं वह मौजूद नहीं है"
}




export { translateNewspaper, translateSuggested, translateRelated, translateChooseLang, translateLang, translateBuzz, translateAbout,
  translateDownload, translateBrowse, translateChangeLang, translateFeaturedTopics, translateAllTopics, translateTopics, translateBrowseFurther,
  translateClickHere, translateEbooks, translateNotFound, translateNotFoundAnother, translateGetApp };
